<template>
  <icon-wrapper :spin="spin" :rotate="rotate">
    <svg
      :width="size"
      :height="size"
      viewBox="0 0 32 32"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
    >
      <g
        id="871.业务规则"
        stroke="none"
        stroke-width="1"
        fill="none"
        fill-rule="evenodd"
      >
        <g
          id="编组"
          transform="translate(4.000000, 2.000000)"
          fill="#000000"
          fill-rule="nonzero"
        >
          <path
            d="M22.1052632,22.1052632 L2.912,22.1052632 C1.94084211,22.1052632 1.47368421,22.6593684 1.47368421,23.5789474 L1.47368421,25.0526316 C1.47368421,25.8661053 2.24589474,26.5263158 2.912,26.5263158 L23.5789474,26.5263158 C23.5789474,27.3397895 23.0395789,28 22.3734737,28 L2.41094737,28 C1.08021053,28 1.09074543e-15,26.6810526 1.09074543e-15,25.0526316 L1.09074543e-15,1.47368421 C1.09074543e-15,0.659790895 0.659790895,1.09074543e-15 1.47368421,1.09074543e-15 L22.1052632,1.09074543e-15 C22.9191565,1.09074543e-15 23.5789474,0.659790895 23.5789474,1.47368421 L23.5789474,20.6315789 C23.5789474,21.4454723 22.9191565,22.1052632 22.1052632,22.1052632 Z M23.5789474,23.5789474 L23.5789474,25.0526316 L3.68421053,25.0526316 C3.27726387,25.0526316 2.94736842,24.7227361 2.94736842,24.3157895 C2.94736842,23.9088428 3.27726387,23.5789474 3.68421053,23.5789474 L23.5789474,23.5789474 Z M4.42105263,10.3157895 L4.42105263,11.7894737 L19.1578947,11.7894737 L19.1578947,10.3157895 L4.42105263,10.3157895 Z M4.42105263,5.89473684 L4.42105263,7.36842105 L19.1578947,7.36842105 L19.1578947,5.89473684 L4.42105263,5.89473684 Z"
            id="形状"
            :fill="fill"
          ></path>
        </g>
      </g>
    </svg>
  </icon-wrapper>
</template>
<script lang="ts">
import { defineComponent } from 'vue';
import iconWrapper from '../components/base.vue';
export default defineComponent({
  name: 'BusinessRules',
  components: { iconWrapper },
  props: {
    size: {
      type: String || Number,
      default: '1em',
    },
    fill: {
      type: String,
      default: 'currentColor',
    },
    rotate: Number,
    spin: Boolean,
  },
});
</script>
