<template>
  <icon-wrapper :spin="spin" :rotate="rotate">
    <svg
      :width="size"
      :height="size"
      viewBox="0 0 32 32"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
    >
      <g
        id="200.输入框清空图标"
        stroke="none"
        stroke-width="1"
        fill="none"
        fill-rule="evenodd"
      >
        <g
          id="输入框清空图标"
          transform="translate(4.000000, 4.000000)"
          fill="#000000"
          fill-rule="nonzero"
        >
          <path
            d="M12,0 C18.627417,0 24,5.37258301 24,12 C24,18.627417 18.627417,24 12,24 C5.37258301,24 0,18.627417 0,12 C0,5.37258301 5.37258301,0 12,0 Z M7.61289939,6.20970461 C7.22060819,5.90467971 6.65337718,5.93240925 6.29289322,6.29289322 L6.29289322,6.29289322 L6.20970461,6.38710061 C5.90467971,6.77939181 5.93240925,7.34662282 6.29289322,7.70710682 L6.29289322,7.70710682 L10.585,12 L6.29289322,16.2928932 C5.90236893,16.6834175 5.90236893,17.3165825 6.29289322,17.7071068 C6.6834175,18.0976311 7.3165825,18.0976311 7.70710682,17.7071068 L7.70710682,17.7071068 L12,13.415 L16.2928932,17.7071068 L16.3871006,17.7902954 C16.7793918,18.0953203 17.3466228,18.0675907 17.7071068,17.7071068 L17.7071068,17.7071068 L17.7902954,17.6128994 C18.0953203,17.2206082 18.0675907,16.6533772 17.7071068,16.2928932 L17.7071068,16.2928932 L13.415,12 L17.7071068,7.70710682 C18.0976311,7.3165825 18.0976311,6.6834175 17.7071068,6.29289322 C17.3165825,5.90236893 16.6834175,5.90236893 16.2928932,6.29289322 L16.2928932,6.29289322 L12,10.585 L7.70710682,6.29289322 L7.61289939,6.20970461 Z"
            id="形状"
            :fill="fill"
          ></path>
        </g>
      </g>
    </svg>
  </icon-wrapper>
</template>
<script lang="ts">
import { defineComponent } from 'vue';
import iconWrapper from '../components/base.vue';
export default defineComponent({
  name: 'ClearInput',
  components: { iconWrapper },
  props: {
    size: {
      type: String || Number,
      default: '1em',
    },
    fill: {
      type: String,
      default: 'currentColor',
    },
    rotate: Number,
    spin: Boolean,
  },
});
</script>
