<template>
  <icon-wrapper :spin="spin" :rotate="rotate">
    <svg
      :width="size"
      :height="size"
      viewBox="0 0 32 32"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
    >
      <g
        id="951.工作角色"
        stroke="none"
        stroke-width="1"
        fill="none"
        fill-rule="evenodd"
      >
        <g
          id="编组"
          transform="translate(2.000000, 3.000000)"
          fill="#000000"
          fill-rule="nonzero"
        >
          <path
            d="M25.6832603,20.994759 C23.8880926,19.6155627 18.7164756,17.3247695 18.7164756,17.3247695 L15.8164759,24.8579834 L14.8975035,21.4859593 L15.8164759,19.6524397 L13.9770559,17.81892 L12.1361609,19.6524397 L13.0580835,21.4859593 L12.1361609,24.8933852 L9.16240737,17.3247695 C9.16240737,17.3247695 3.98931528,19.6170378 2.1941476,20.994759 C1.29435114,21.6880447 0.581889356,22.9094078 0.0611874723,24.6632734 C-0.0714821259,25.1094747 0.0142580415,25.5921198 0.29249238,25.9653256 C0.570726719,26.3385314 1.00880336,26.5585007 1.47431043,26.5587462 L26.5255288,26.5587462 C26.9864738,26.5585531 27.4208289,26.3428966 27.6996142,25.9758147 C27.9783995,25.6087329 28.0695605,25.1324328 27.9460272,24.6883497 C27.4843283,23.0303641 26.7290893,21.7986755 25.6832603,20.994759 L25.6832603,20.994759 Z M14.1098128,16.8011221 C18.3255805,16.7937421 21.1356005,11.2577812 21.1356005,8.2781274 C21.1356005,5.29847356 21.1237999,0 14.1098128,0 C7.09877582,0 7.08550014,5.29847356 7.08550014,8.2781274 C7.08550014,11.2577812 9.89552022,16.8070177 14.1098128,16.8011221 Z"
            id="形状"
            :fill="color"
          ></path>
        </g>
      </g>
    </svg>
  </icon-wrapper>
</template>
<script lang="ts">
import { defineComponent } from 'vue';
import iconWrapper from '../components/base.vue';
export default defineComponent({
  name: 'JobRoles',
  components: { iconWrapper },
  props: {
    size: {
      type: String || Number,
      default: '1em',
    },
    color: {
      type: String,
      default: 'currentColor',
    },
    rotate: Number,
    spin: Boolean,
  },
});
</script>
