<template>
  <icon-wrapper :spin="spin" :rotate="rotate">
    <svg
      :width="size"
      :height="size"
      viewBox="0 0 32 32"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
    >
      <g
        id="779.实习"
        stroke="none"
        stroke-width="1"
        fill="none"
        fill-rule="evenodd"
      >
        <g
          id="编组"
          transform="translate(2.000000, 6.000000)"
          fill="#000000"
          fill-rule="nonzero"
        >
          <path
            d="M27.4827231,6.12925152 C27.7824927,6.30493045 27.9679316,6.63119134 27.9665373,7.01740615 C27.9874515,7.112217 28,7.21121069 28,7.31299293 L28,19.5645074 C28,20.2895316 27.8006183,20.9253221 27.0923255,20.9253221 C26.3840326,20.9253221 26.1483998,20.271406 26.1483998,19.5449876 L26.1483998,9.02237688 L14.4699332,11.622704 C14.1743592,11.7967398 13.8076387,11.7967398 13.5120647,11.622704 L0.481149222,7.94878337 C0.179304409,7.76790347 -0.00383054624,7.44038386 6.08008794e-05,7.08851429 C0.00126455623,6.73656508 0.189184824,6.41168598 0.493697718,6.23521659 L14.3528139,0.125493527 C14.6456122,-0.0432140245 15.0053357,-0.0418197472 15.2981339,0.129676359 L27.4841174,6.12785724 L27.4827231,6.12925152 Z M5.73199748,10.893497 C10.586871,12.3937394 13.6082699,13.1438605 14.7947998,13.1438605 C15.9813298,13.1438605 19.0027287,12.3937394 23.8576022,10.893497 L23.8576022,16.9837002 C20.7929807,18.6749585 17.7715818,19.5212848 14.7947998,19.5212848 C11.8180178,19.5212848 8.79661895,18.6749585 5.73199748,16.9837002 L5.73199748,10.893497 Z"
            id="形状"
            :fill="color"
          ></path>
        </g>
      </g>
    </svg>
  </icon-wrapper>
</template>
<script lang="ts">
import { defineComponent } from 'vue';
import iconWrapper from '../components/base.vue';
export default defineComponent({
  name: 'Practice',
  components: { iconWrapper },
  props: {
    size: {
      type: String || Number,
      default: '1em',
    },
    color: {
      type: String,
      default: 'currentColor',
    },
    rotate: Number,
    spin: Boolean,
  },
});
</script>
