<template>
  <icon-wrapper :spin="spin" :rotate="rotate">
    <svg
      :width="size"
      :height="size"
      viewBox="0 0 32 32"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlns:xlink="http://www.w3.org/1999/xlink"
    >
      <g
        id="277.项目基础资料"
        stroke="none"
        stroke-width="1"
        fill="none"
        fill-rule="evenodd"
      >
        <g
          id="项目基础资料"
          transform="translate(5.000000, 4.000000)"
          fill="#000000"
          fill-rule="nonzero"
        >
          <path
            d="M5.07692308,1.41176536 L5.07692308,5.14285714 L16.9230769,5.14285714 L16.9230769,1.41176536 L20.6896845,1.41176536 C21.4133524,1.41176536 22,2.01594533 22,2.757116 L22,22.6546493 C22,23.3976653 21.4115538,24 20.6896845,24 L1.31031553,24 C0.586648886,24 0,23.3958187 0,22.6546493 L0,2.757116 C0,2.01409868 0.588447444,1.41176536 1.31031553,1.41176536 L5.07692308,1.41176536 Z M16.0769231,15.4285714 L5.92307692,15.4285714 C5.45575907,15.4285714 5.07692308,15.8123274 5.07692308,16.2857143 C5.07692308,16.7591012 5.45575907,17.1428571 5.92307692,17.1428571 L16.0769231,17.1428571 C16.5442409,17.1428571 16.9230769,16.7591012 16.9230769,16.2857143 C16.9230769,15.8123274 16.5442409,15.4285714 16.0769231,15.4285714 Z M16.0769231,10.2857143 L5.92307692,10.2857143 C5.45575907,10.2857143 5.07692308,10.6694703 5.07692308,11.1428571 C5.07692308,11.616244 5.45575907,12 5.92307692,12 L16.0769231,12 C16.5442409,12 16.9230769,11.616244 16.9230769,11.1428571 C16.9230769,10.6694703 16.5442409,10.2857143 16.0769231,10.2857143 Z M15.2307692,0 L15.2307692,3.42857143 L6.76923077,3.42857143 L6.76923077,0 L15.2307692,0 Z"
            id="形状"
            :fill="fill"
          ></path>
        </g>
      </g>
    </svg>
  </icon-wrapper>
</template>
<script lang="ts">
import { defineComponent } from 'vue';
import iconWrapper from '../components/base.vue';
export default defineComponent({
  name: 'ProBasedata',
  components: { iconWrapper },
  props: {
    size: {
      type: String || Number,
      default: '1em',
    },
    fill: {
      type: String,
      default: 'currentColor',
    },
    rotate: Number,
    spin: Boolean,
  },
});
</script>
