import React from 'react';
import { IconWrapper, SvgIconProps } from '../components/index';

const ClientOne = ({
  size = '1em',
  fill = 'currentColor',
  rotate = 0,
  spin = false,
  ...restProps
}: SvgIconProps) => {
  return (
    <IconWrapper rotate={rotate} spin={spin} {...restProps}>
      <svg
        width={size}
        height={size}
        viewBox="0 0 32 32"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g
          id="1300-客户"
          stroke="none"
          strokeWidth="1"
          fill="none"
          fillRule="evenodd"
        >
          <g
            id="编组"
            transform="translate(4.000000, 4.000000)"
            fill="#000000"
            fillRule="nonzero"
          >
            <path
              d="M16.6153846,14.7692308 C20.6937951,14.7692308 24,18.0754357 24,22.1538462 L24,24 L0,24 L0,22.1538462 C0,18.0754357 3.30620494,14.7692308 7.38461538,14.7692308 L16.6153846,14.7692308 Z M16.6153846,16.6153846 L7.38461538,16.6153846 C4.39532591,16.6153846 1.95916451,18.9836076 1.84997397,21.9462108 L1.84615385,22.1538462 L22.1538462,22.1538462 C22.1538462,19.1645567 19.7856232,16.7283953 16.82302,16.6192048 L16.6153846,16.6153846 Z M12,0 C15.5686091,0 18.4615385,2.89292931 18.4615385,6.46153846 C18.4615385,10.0301476 15.5686091,12.9230769 12,12.9230769 C8.43139091,12.9230769 5.53846154,10.0301476 5.53846154,6.46153846 C5.53846154,2.89292931 8.43139091,0 12,0 Z M12,1.84615385 C9.4509935,1.84615385 7.38461538,3.91253193 7.38461538,6.46153846 C7.38461538,9.01054496 9.4509935,11.0769231 12,11.0769231 C14.5490065,11.0769231 16.6153846,9.01054496 16.6153846,6.46153846 C16.6153846,3.91253193 14.5490065,1.84615385 12,1.84615385 Z"
              id="形状"
              fill={fill}
            ></path>
          </g>
        </g>
      </svg>
    </IconWrapper>
  );
};
ClientOne.displayName = 'ClientOne';
export default ClientOne;
